Tekla Open API Reference for Tekla Structures 2025
View.CreateSnapshot Method
[Missing <summary> documentation for "M:Tekla.Structures.Model.UI.View.CreateSnapshot(System.String,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)"]
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool CreateSnapshot(
	string filePath,
	SnapshotSettings snapshotSettings,
	bool overwrite = true
)
Public Function CreateSnapshot (
	filePath As String,
	snapshotSettings As SnapshotSettings,
	Optional overwrite As Boolean = true
) As Boolean
Parameters
filePath
Type: System.String
[Missing <param name="filePath"/> documentation for "M:Tekla.Structures.Model.UI.View.CreateSnapshot(System.String,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)"]
snapshotSettings
Type: SnapshotSettings
[Missing <param name="snapshotSettings"/> documentation for "M:Tekla.Structures.Model.UI.View.CreateSnapshot(System.String,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)"]
overwrite (Optional)
Type: System.Boolean
[Missing <param name="overwrite"/> documentation for "M:Tekla.Structures.Model.UI.View.CreateSnapshot(System.String,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)"]
Return Value
Type: Boolean
[Missing <returns> documentation for "M:Tekla.Structures.Model.UI.View.CreateSnapshot(System.String,Tekla.Structures.Model.UI.SnapshotSettings,System.Boolean)"]
See Also
Reference
View Class
Tekla.Structures.Model.UI Namespace